<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 3.1.3: 
# *Database Programming with Python and SQLite*

<a name="demo"></a>
## Using SQLite

### Advantages of SQLite

- does not run on a separate server
- creates portable SQL databases saved in a single file
- databases are stored in a very efficient manner and allow fast querying
- ideal for small databases or databases that need to be copied across machines.
- prototyping applications (e.g. as an embedded database server in a Python program).

### The `sqlite3` Command Line Utility

- useful for basic SQL tasks and databse maintenance
- for creating and dropping databases, it may be safer to use the command line than to roll the code into a Python program

1. Add the sqlite3 installation folder to your PATH environment variable.
2. Open a command window.
3. Navigate to your preferred working directory.
4. Start the sqlite3 command line utility and create a database called "ex1":

`$ sqlite3 ex1`

Output:  

`SQLite version 3.8.5 2014-05-29 12:36:14
Enter ".help" for usage hints.
sqlite>`

*Nb. If you leave out the database name (after `sqlite3`, above) a new, temporary database will be created; it will be destroyed upon exiting sqlite3.*

Enter the following commands at the sqlite prompt (not shown):

`create table tbl1(one varchar(10), two smallint);
insert into tbl1 values('hello!',10);
insert into tbl1 values('goodbye', 20);
select * from tbl1;`

Output:  

`hello!|10
goodbye|20`

Enter `.help` at the sqlite3 command prompt. This lists the available "dot commands". 

Some of the more useful dot commands include:

`  
.backup ?DB? FILE      Backup DB (default "main") to FILE.
.cd DIRECTORY          Change the working directory to DIRECTORY
.clone NEWDB           Clone data into NEWDB from the existing database
.databases             List names and files of attached databases
.dump ?TABLE? ...      Dump the database in an SQL text format.
.excel                 Display the output of next command in a spreadsheet
.exit                  Exit this program
.headers on|off        Turn display of headers on or off
.help                  Show this message
.import FILE TABLE     Import data from FILE into TABLE
.indexes ?TABLE?       Show names of all indexes.
.quit                  Exit this program
.read FILENAME         Execute SQL in FILENAME
.restore ?DB? FILE     Restore content of DB (default "main") from FILE
.save FILE             Write in-memory database into FILE
.tables ?TABLE?        List names of tables.`

### The `sqlite3` package

The easiest way to incorporate an SQL database into a Python application is by using the `sqlite3` package for [`Python 2.7`](https://docs.python.org/2.7/library/sqlite3.html) or [`Python 3.x`](https://docs.python.org/3/library/sqlite3.html).

Open a connection to an SQLite database file.  As before, if the file does not already exist it will automatically be created.

In [1]:
import sqlite3
sqlite_db = 'test_db.sqlite'
conn = sqlite3.connect(sqlite_db) 
c = conn.cursor()

In [2]:
pwd

'C:\\Users\\imran\\IOD Week 3'

Commands can be executed by passing them as string arguments to the `execute` method of the cursor we just created for this database.

*Nb. If this script has never been run before, the following will raise an (inconsequential) error message:*

In [3]:
c.execute('DROP TABLE houses;')

# Save (commit) the changes:
conn.commit()

OperationalError: no such table: houses

In [3]:
c.execute('CREATE TABLE houses (field1 INTEGER PRIMARY KEY, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER);')
conn.commit()

OperationalError: table houses already exists

With the database saved the table should now be viewable using SQLite Manager.

#### Adding data

Since we're back in python, we can now use regular programming techniques in conjunction with the sqlite connection.  In particular, the cursor's `execute()` method supports value substitution using the `?` character, which makes adding multiple records a bit easier.  See the [docs](https://docs.python.org/2.7/library/sqlite3.html) for more details.

> c.execute(sql_command, values)

In [4]:
# A
last_sale = (None, 4000, 5, 22, 619000)

# Execute Command to Insert a row of data
c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', last_sale)

# Remember to commit the changes
conn.commit()

Notice that in this syntax we use the python `None` value, rather than `NULL`, to trigger SQLite to auto-increment the Primary Key. 

There is a related cursor method `executemany()` which takes an array of tuples and loops through them, substituting one tuple at a time.

> c.executemany(sql_command, values)

In [5]:
# A
recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),
  (None, 1505, 3, 90, 269000),
]

# Nb. The "?" parameters are placeholders for data that will map to the table columns during insertion;
# this is a security measure against SQL injection attacks:

# Execute Command to Insert many rows of data

c.executemany('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', recent_sales)

conn.commit()

Select all rows from houses

In [6]:
# A - call fetchall() to get a list of the matching rows

c.execute('SELECT * FROM houses').fetchall()

[(1, 2104, 3, 70, 399900),
 (2, 1600, 3, 28, 329900),
 (3, 2400, 3, 44, 369000),
 (4, 1416, 2, 49, 232000),
 (5, 3000, 4, 75, 539900),
 (6, 1985, 4, 61, 299900),
 (7, 1534, 3, 12, 314900),
 (8, 1427, 3, 57, 198999),
 (9, 1380, 3, 14, 212000),
 (10, 1494, 3, 15, 242500),
 (11, 1940, 4, 7, 239999),
 (12, 2000, 3, 27, 347000),
 (13, 1890, 3, 45, 329999),
 (14, 4478, 5, 49, 699900),
 (15, 1268, 3, 58, 259900),
 (16, 2300, 4, 77, 449900),
 (17, 1320, 2, 62, 299900),
 (18, 1236, 3, 78, 199900),
 (19, 2609, 4, 5, 499998),
 (20, 3031, 4, 21, 599000),
 (21, 1767, 3, 44, 252900),
 (22, 1888, 2, 79, 255000),
 (23, 1604, 3, 13, 242900),
 (24, 1962, 4, 53, 259900),
 (25, 3890, 3, 36, 573900),
 (26, 1100, 3, 60, 249900),
 (27, 1458, 3, 29, 464500),
 (28, 2526, 3, 13, 469000),
 (29, 2200, 3, 28, 475000),
 (30, 2637, 3, 25, 299900),
 (31, 1839, 2, 40, 349900),
 (32, 1000, 1, 5, 169900),
 (33, 2040, 4, 75, 314900),
 (34, 3137, 3, 67, 579900),
 (35, 1811, 4, 24, 285900),
 (36, 1437, 3, 50, 249900),
 (37, 1239, 3, 22, 229900),
 (38, 2132, 4, 28, 345000),
 (39, 4215, 4, 66, 549000),
 (40, 2162, 4, 43, 287000),
 (41, 1664, 2, 40, 368500),
 (42, 2238, 3, 37, 329900),
 (43, 2567, 4, 57, 314000),
 (44, 1200, 3, 76, 299000),
 (45, 852, 2, 70, 179900),
 (46, 1852, 4, 64, 299900),
 (47, 1203, 3, 11, 239500),
 (48, 2104, 3, 70, 399900),
 (49, 1600, 3, 28, 329900),
 (50, 2400, 3, 44, 369000),
 (51, 1416, 2, 49, 232000),
 (54, 1534, 3, 12, 314900),
 (55, 1427, 3, 57, 198999),
 (56, 1380, 3, 14, 212000),
 (57, 1494, 3, 15, 242500),
 (58, 1940, 4, 7, 239999),
 (59, 2000, 3, 27, 347000),
 (60, 1890, 3, 45, 329999),
 (61, 4478, 5, 49, 699900),
 (62, 1268, 3, 58, 259900),
 (63, 2300, 4, 77, 449900),
 (64, 1320, 2, 62, 299900),
 (65, 1236, 3, 78, 199900),
 (66, 2609, 4, 5, 499998),
 (67, 3031, 4, 21, 599000),
 (68, 1767, 3, 44, 252900),
 (69, 1888, 2, 79, 255000),
 (70, 1604, 3, 13, 242900),
 (71, 1962, 4, 53, 259900),
 (72, 3890, 3, 36, 573900),
 (73, 1100, 3, 60, 249900),
 (74, 1458, 3, 29, 464500),
 (75, 2526, 3, 13, 469000),
 (76, 2200, 3, 28, 475000),
 (77, 2637, 3, 25, 299900),
 (78, 1839, 2, 40, 349900),
 (79, 1000, 1, 5, 169900),
 (80, 2040, 4, 75, 314900),
 (81, 3137, 3, 67, 579900),
 (82, 1811, 4, 24, 285900),
 (83, 1437, 3, 50, 249900),
 (84, 1239, 3, 22, 229900),
 (85, 2132, 4, 28, 345000),
 (86, 4215, 4, 66, 549000),
 (87, 2162, 4, 43, 287000),
 (88, 1664, 2, 40, 368500),
 (89, 2238, 3, 37, 329900),
 (90, 2567, 4, 57, 314000),
 (91, 1200, 3, 76, 299000),
 (92, 852, 2, 70, 179900),
 (93, 1852, 4, 64, 299900),
 (94, 1203, 3, 11, 239500),
 (95, 1200, 3, 15, 250000),
 (96, 4000, 5, 22, 619000),
 (97, 2390, 4, 34, 319000),
 (98, 1870, 3, 14, 289000),
 (99, 1505, 3, 90, 269000),
 (100, 4000, 5, 22, 619000),
 (101, 2390, 4, 34, 319000),
 (102, 1870, 3, 14, 289000),
 (103, 1505, 3, 90, 269000)]




#### Adding data from a csv file
One way to populate the database from a file is to use `numpy.genfromtxt` to read the file into an array (converted to a list for easier handling), and then `INSERT` those records into the database.  The `genfromtxt` function has options including the output data type, handling of missing values, skipping of header and footer rows, columns to read, and more.

In [7]:
from numpy import genfromtxt

# import into nparray of ints, then convert to list of lists:
data = genfromtxt('C:/Users/imran/OneDrive/Desktop/lesson notes/housing-data.csv', dtype = 'i8', 
                    delimiter = ',', skip_header = 1).tolist()

Suppose we need to put a placeholder in the first column for data that will be available later. Best practice is to insert the value `None`:

In [8]:
# prepend a None value to beginning of each sub-list:
for d in data:
    d.insert(0, None)

*Nb. This is why we converted the input array to a list. An array can only hold one type of data (integers in this case) so we could not have inserted `None` before we did this conversion.*

In [9]:
# check:
print(type(data))
print(data[0:3])

<class 'list'>
[[None, 2104, 3, 70, 399900], [None, 1600, 3, 28, 329900], [None, 2400, 3, 44, 369000]]

Now we can insert each list item as a row of fields in the database.

In [10]:
# loop through data, running an INSERT on each record (i.e. sublist):
for d in data:
    c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d)

conn.commit()

In this case, because we were inserting the same value for all records, so we could have simply used a 'None' in the numpy `insert` method at column 0.

In [11]:
import numpy as np
d1 = np.asarray([1200, 3, 15, 250000])
d1 = d1.tolist()
d1.insert(0, None)
d1
c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d1)
conn.commit()

#### Deleting Rows

The `DELETE FROM` statement can be used with a `WHERE` clause to specify rows to delete based on some criteria.

In [12]:
c.execute('DELETE FROM houses WHERE field1 IN (52, 53)')
conn.commit()

#### Filtering Rows

**1. Select Rows Where Bedrooms = 4**

In [13]:
# ANSWER
results = c.execute('SELECT * FROM houses WHERE bdrms = 4')
    
# here results is a cursor object - use fetchall() to extract a list    
results.fetchall()

[(5, 3000, 4, 75, 539900),
 (6, 1985, 4, 61, 299900),
 (11, 1940, 4, 7, 239999),
 (16, 2300, 4, 77, 449900),
 (19, 2609, 4, 5, 499998),
 (20, 3031, 4, 21, 599000),
 (24, 1962, 4, 53, 259900),
 (33, 2040, 4, 75, 314900),
 (35, 1811, 4, 24, 285900),
 (38, 2132, 4, 28, 345000),
 (39, 4215, 4, 66, 549000),
 (40, 2162, 4, 43, 287000),
 (43, 2567, 4, 57, 314000),
 (46, 1852, 4, 64, 299900),
 (58, 1940, 4, 7, 239999),
 (63, 2300, 4, 77, 449900),
 (66, 2609, 4, 5, 499998),
 (67, 3031, 4, 21, 599000),
 (71, 1962, 4, 53, 259900),
 (80, 2040, 4, 75, 314900),
 (82, 1811, 4, 24, 285900),
 (85, 2132, 4, 28, 345000),
 (86, 4215, 4, 66, 549000),
 (87, 2162, 4, 43, 287000),
 (90, 2567, 4, 57, 314000),
 (93, 1852, 4, 64, 299900),
 (97, 2390, 4, 34, 319000),
 (101, 2390, 4, 34, 319000),
 (108, 3000, 4, 75, 539900),
 (109, 1985, 4, 61, 299900),
 (114, 1940, 4, 7, 239999),
 (119, 2300, 4, 77, 449900),
 (122, 2609, 4, 5, 499998),
 (123, 3031, 4, 21, 599000),
 (127, 1962, 4, 53, 259900),
 (136, 2040, 4, 75, 314900),
 (138, 1811, 4, 24, 285900),
 (141, 2132, 4, 28, 345000),
 (142, 4215, 4, 66, 549000),
 (143, 2162, 4, 43, 287000),
 (146, 2567, 4, 57, 314000),
 (149, 1852, 4, 64, 299900)]

**2. Run a query to calculate the average floor area and price of each size of house (i.e. by number of bedrooms):**

In [14]:
# ANSWER
results = c.execute("SELECT bdrms, AVG(sqft) AS avg_sqft, AVG(price) AS avg_price FROM houses GROUP BY bdrms")
results.fetchall()

[(1, 1000.0, 169900.0),
 (2, 1496.5, 280866.6666666667),
 (3, 1815.5185185185185, 322176.4691358025),
 (4, 2395.5476190476193, 372645.0238095238),
 (5, 4286.8, 667540.0)]

### Pandas connector

While databases provide many analytical capabilities, at some point we may need to pull data into Python for more flexible processing. Large, fixed operations would be more efficient in a database, but Pandas allows for interactive processing.

For example, if you want to aggregate nightly log-ins or sales for a report or dashboard, this would be a fixed operation on a large dataset. These computations would run more efficiently in the database system itself.

However, if we wanted to model the patterns of login behaviour or factors driving sales, then we would import the data to Python where we could use its simple interfaces to powerful analytic libraries.

In [15]:
import pandas as pd
from pandas.io import sql

Pandas can connect to most relational databases. In this demonstration, we will create and connect to a SQLite database.

### Writing data into a database

Data in Pandas can be loaded into a relational database. 

If the data table is not too large, we can load all of it into a Pandas DataFrame:

In [16]:
# Nb. Use low_memory=False to ensure that type inference does not fail due to buffered processing of input:
data = pd.read_csv('C:/Users/imran/OneDrive/Desktop/lesson notes/housing-data.csv', low_memory = False)
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

We can move data in the opposite direction -- from a DataFrame to a database -- using the `to_sql` command, similar to the `to_csv` command.

`to_sql` takes as arguments:
    - `name`, the table name to create
    - `con`, a connection to a database
    - `index`, whether to input the index column
    - `schema`, if we want to write a custom schema for the new table
    - `if_exists`, what to do if the table already exists. We can overwrite it, add to it, or fail

This copies our `data` DataFrame to a sqlite3 table called `houses_pandas`:

In [17]:
data.to_sql('houses_pandas', con = conn, if_exists = 'replace', index = False)

In [18]:
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

Run a query to get the average price of each house size from this table:

In [19]:
#ANSWER
results = c.execute('SELECT sqft, AVG(price) AS avg_price FROM houses_pandas GROUP BY sqft ORDER BY avg_price DESC')
results.fetchall()

[(4478, 699900.0),
 (3031, 599000.0),
 (3137, 579900.0),
 (3890, 573900.0),
 (4215, 549000.0),
 (3000, 539900.0),
 (2609, 499998.0),
 (2200, 475000.0),
 (2526, 469000.0),
 (1458, 464500.0),
 (2300, 449900.0),
 (2104, 399900.0),
 (2400, 369000.0),
 (1664, 368500.0),
 (1839, 349900.0),
 (2000, 347000.0),
 (2132, 345000.0),
 (1890, 329999.0),
 (2238, 329900.0),
 (1600, 329900.0),
 (2040, 314900.0),
 (1534, 314900.0),
 (2567, 314000.0),
 (2637, 299900.0),
 (1985, 299900.0),
 (1852, 299900.0),
 (1320, 299900.0),
 (1200, 299000.0),
 (2162, 287000.0),
 (1811, 285900.0),
 (1962, 259900.0),
 (1268, 259900.0),
 (1888, 255000.0),
 (1767, 252900.0),
 (1437, 249900.0),
 (1100, 249900.0),
 (1604, 242900.0),
 (1494, 242500.0),
 (1940, 239999.0),
 (1203, 239500.0),
 (1416, 232000.0),
 (1239, 229900.0),
 (1380, 212000.0),
 (1236, 199900.0),
 (1427, 198999.0),
 (852, 179900.0),
 (1000, 169900.0)]

## Discussion

**Scenarios for using Pandas with SQLite**

1. When would you want to use Pandas on a dataset before storing it in a database?

2. When would you want to use Pandas on a dataset retrieved from a database?

<a name="guided-practice"></a>


# Reference: SQL Syntax 


#### SELECT Statement
Every query should start with `SELECT`.  `SELECT` is followed by the names of the columns in the output.

`SELECT` is always paired with `FROM`, and `FROM` identifies the table to retrieve data from.

```sql
SELECT
<columns>
FROM
<table>
```

`SELECT *` denotes returns *all* of the columns.

Housing Data example:
```sql
SELECT
sqft, bdrms
FROM houses_pandas;
```

**Check:** Write a query that returns the `sqft`, `bdrms` and `price`.

```sql
SELECT
sqft, bdrms, price
FROM houses_pandas;
```

#### WHERE Clause
`WHERE` is used to filter table to a specific criteria and follows the `FROM` clause.

```sql
SELECT
<columns>
FROM
<table>
WHERE
<condition>
```
Example:
```sql
SELECT
sqft, bdrms, age, price
FROM houses_pandas
WHERE bdrms = 2 and price < 250000;
```

The condition is effectively a row filter; rows that match the condition will be included in the rowset that is returned by the query.

**Check:** Write a query that returns the `sqft`, `bdrms`, `age` for houses older than 60 years.
>```sql
SELECT
sqft, bdrms, age
FROM houses_pandas
WHERE age > 60;
```

### AGGREGATIONS

Aggregations (or aggregate functions) are functions where the values of multiple rows are grouped together as input on certain criteria to form a single value of more significant meaning or measurement such as a set, a bag or a list.

Examples of aggregate funtions:

- Average (i.e., arithmetic mean)
- Count
- Maximum
- Minimum
- Median
- Mode
- Sum

In SQL they are performed in a `SELECT` statement as follows.

```sql
SELECT COUNT(price)
FROM houses_pandas;
```

```sql
SELECT AVG(sqft), MIN(price), MAX(price)
FROM houses_pandas
WHERE bdrms = 2;
```

### Read Order Data
- P12-ListOfOrders
- P12-OrderBreakdown

#### 1. Read CSV into DataFrame

In [34]:
import pandas as pd
import sqlite3
from pandas.io import sql

In [22]:
# Reading CSV to Dataframe
orders = pd.read_csv('C:/Users/imran/OneDrive/Desktop/lesson notes/P12-ListOfOrders.csv', encoding = 'utf-8')
orders_break_down =  pd.read_csv('C:/Users/imran/OneDrive/Desktop/lesson notes/P12-OrderBreakdown.csv', encoding = 'utf-8')

In [37]:
orders.head()

          Order ID  Order Date      Customer Name         Country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France

In [23]:
orders_break_down.head()

,Order ID,Product Name,Discount,Sales,Quantity,Category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45.0,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854.0,7,Furniture
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140.0,3,Office Supplies
3,IT-2011-2942451,"Boston Markers, Easy-Erase",0.5,27.0,2,Office Supplies
4,IT-2011-2942451,"Eldon Folders, Single Width",0.5,17.0,2,Office Supplies

#### 2. Replace Space with Underscore in Column Names

In [24]:
# ANSWER
orders.columns = [o.replace(' ', '_') for o in orders.columns.str.lower()]

In [40]:
orders.head() # see new column names

          order_id  order_date      customer_name         country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France

In [25]:
# ANSWER
orders_break_down.columns = [o.replace(' ', '_') for o in orders_break_down.columns.str.lower()]

In [42]:
orders_break_down.head()

,order_id,product_name,discount,sales,quantity,category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45.0,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854.0,7,Furniture
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140.0,3,Office Supplies
3,IT-2011-2942451,"Boston Markers, Easy-Erase",0.5,27.0,2,Office Supplies
4,IT-2011-2942451,"Eldon Folders, Single Width",0.5,17.0,2,Office Supplies

#### 3. Check DataTypes

In [61]:
# ANSWER - orders
orders.dtypes

order_id         object
order_date       object
customer_name    object
country          object
dtype: object

In [62]:
# ANSWER - orders_break_down
orders_break_down.dtypes

order_id         object
product_name     object
discount        float64
sales           float64
quantity          int64
category         object
dtype: object

#### 4. Save these two dataframes as a table in sqlite

In [26]:
# Establishing Local DB connection
db_connection = sqlite3.connect('C:/Users/imran/OneDrive/Desktop/lesson notes/eshop.db.sqlite')

# Save these two dataframes as a table in sqlite - using the to_sql command (see above)
orders.to_sql('orders', con = db_connection, if_exists = 'replace', index = False)
orders_break_down.to_sql('orders_break_down', con = db_connection, if_exists = 'replace', index = False)

#### 5. Select Number of Orders for Each Customer

We can use the `sql` function in `pandas.io` to run SQL queries to the database with the `.read_sql()` method. Here's an example:

In [27]:
# EXAMPLE - Select first 10 rows of all columns in orders table

query = """
        SELECT * 
        FROM orders 
        LIMIT 10;
        """

orders_head_10 = sql.read_sql(query, con=db_connection)
orders_head_10

          order_id  order_date      customer_name         country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France
5  ES-2011-5433855  2011-01-07       Dave Poirier          France
6  IT-2011-4546695  2011-01-08      Darren Powers          France
7  ES-2011-1138719  2011-01-11       Eric Murdock           Italy
8  ES-2011-1466305  2011-01-11         Mick Brown         Austria
9  ES-2011-4359424  2011-01-11  Dorothy Dickinson           Spain

In [121]:
# Select Number of Orders for Each Customer 

query = """
        SELECT customer_name, COUNT(*) AS "Number of Orders"
        FROM orders 
        GROUP BY customer_name
        ORDER BY "Number of Orders" DESC;
        """

orders_num_orders = sql.read_sql(query, con=db_connection)
orders_num_orders

         customer_name  Number of Orders
0           John Grady                13
1         Joel Jenkins                12
2       Aaron Smayling                12
3       Yoseph Carroll                11
4          Sarah Brown                11
..                 ...               ...
787  Brooke Gillingham                 1
788     Barbara Fisher                 1
789       Art Ferguson                 1
790        Andy Reiter                 1
791            Amy Cox                 1

[792 rows x 2 columns]

#### 6. Select Number of Customers for Each Country

In [97]:
# Select Number of Customers for Each Country
query = """
        SELECT country, COUNT(DISTINCT customer_name) AS "Number of customers"
        FROM orders 
        GROUP BY country
        ORDER BY "Number of customers" DESC;
        """

orders_num_cust = sql.read_sql(query, con=db_connection)
orders_num_cust

           country  Number of customers
0           France                  568
1          Germany                  505
2   United Kingdom                  473
3            Italy                  351
4            Spain                  306
5      Netherlands                  172
6          Austria                  125
7           Sweden                   96
8          Belgium                   66
9          Ireland                   48
10     Switzerland                   39
11          Norway                   37
12        Portugal                   36
13         Finland                   33
14         Denmark                   28

#### 7.A Select discount, sales, quantity for Each Order from orders_break_down Table

In [103]:
#  Select discount, sales, quantity for Each Order from orders_break_down Table

query = """
        SELECT order_id, discount, sales, quantity 
        FROM orders_break_down
        GROUP BY order_id
        LIMIT 10;
        """

orders_break_down_10 = sql.read_sql(query, con=db_connection1)
orders_break_down_10

          order_id  discount  sales  quantity
0  ES-2011-1001989       0.1  229.0         9
1  ES-2011-1010958       0.0   58.0         2
2  ES-2011-1012469       0.0  148.0         3
3  ES-2011-1043483       0.0  224.0        11
4  ES-2011-1058269       0.0   13.0         2
5  ES-2011-1084683       0.0   63.0         2
6  ES-2011-1088527       0.0   76.0         4
7  ES-2011-1119145       0.0   18.0         2
8  ES-2011-1122594       0.0   58.0         2
9  ES-2011-1136913       0.0   84.0         4

#### 7.B Select discount, sales, quantity, total price for Each Order from orders_break_down Table

> Total Price = sales * quantity - discount

In [105]:
# Select discount, sales, quantity, total price for Each Order from orders_break_down Table

query = """
        SELECT order_id, discount, sales, quantity, (sales*quantity-discount) AS "Total Price"
        FROM orders_break_down
        GROUP BY order_id
        LIMIT 10;
        """

orders_break_down_2 = sql.read_sql(query, con=db_connection1)
orders_break_down_2

          order_id  discount  sales  quantity  Total Price
0  ES-2011-1001989       0.1  229.0         9       2060.9
1  ES-2011-1010958       0.0   58.0         2        116.0
2  ES-2011-1012469       0.0  148.0         3        444.0
3  ES-2011-1043483       0.0  224.0        11       2464.0
4  ES-2011-1058269       0.0   13.0         2         26.0
5  ES-2011-1084683       0.0   63.0         2        126.0
6  ES-2011-1088527       0.0   76.0         4        304.0
7  ES-2011-1119145       0.0   18.0         2         36.0
8  ES-2011-1122594       0.0   58.0         2        116.0
9  ES-2011-1136913       0.0   84.0         4        336.0

#### 7.C Select All Orders from orders_break_down Table Where Total Price Greater Than 100

In [122]:
# Select All Orders from orders_break_down Table Where Total Price Greater Than 100

query = """
        SELECT order_id, discount, sales, quantity, (sales*quantity-discount) AS "Total Price"
        FROM orders_break_down
        WHERE "Total Price" > 100
        GROUP BY order_id
        ORDER BY "Total Price" DESC
        LIMIT 10;
        """

orders_break_down_3 = sql.read_sql(query, con=db_connection1)
orders_break_down_3

          order_id  discount   sales  quantity  Total Price
0  ES-2014-3785216      0.10  5729.0        14     80205.90
1  ES-2011-3248922      0.00  6517.0        12     78204.00
2  ES-2013-2860574      0.00  5274.0        10     52740.00
3  ES-2012-5671193      0.00  5725.0         9     51525.00
4  IT-2011-1978668      0.10  4544.0        11     49983.90
5  ES-2013-5988314      0.10  4618.0         9     41561.90
6  IT-2013-3695467      0.50  3400.0        12     40799.50
7  ES-2011-3517120      0.00  2859.0        14     40026.00
8  IT-2014-3150765      0.50  2830.0        13     36789.50
9  ES-2011-4500805      0.15  4449.0         8     35591.85

#### 8. Select All Customer And The Product They Have Bought

In [136]:
# Select All Customer And The Product They Have Bought - JOIN

query = """
        SELECT o.customer_name, b.product_name
        FROM orders AS o
        LEFT JOIN orders_break_down AS b ON o.order_id = b.order_id
        LIMIT 10;
        """

query1 = sql.read_sql(query, con=db_connection)
query1

       customer_name                                  product_name
0       Eugene Moren                   Enermax Note Cards, Premium
1  Dorothy Dickinson            Dania Corner Shelving, Traditional
2     Arthur Prichep         Binney & Smith Sketch Pad, Easy-Erase
3     Grant Thornton                    Boston Markers, Easy-Erase
4     Grant Thornton                   Eldon Folders, Single Width
5   Michael Granlund  Binney & Smith Pencil Sharpener, Water Color
6   Michael Granlund                   Sanford Canvas, Fluorescent
7       Dave Poirier             Accos Thumb Tacks, Assorted Sizes
8       Dave Poirier                 Bush Floating Shelf Set, Pine
9       Dave Poirier                     Smead Lockers, Industrial

#### 9.A Select Number of 'Furniture' Orders For Each Country

In [143]:
# Select Number of 'Furniture' Orders For Each Country


query = """
        SELECT o.country, COUNT(b.category) AS "Number of Furniture"
        FROM orders AS o
        LEFT JOIN orders_break_down AS b 
        ON o.order_id = b.order_id
        WHERE b.category = 'Furniture'
        GROUP BY o.country
        ORDER BY "Number of Furniture" DESC
        LIMIT 10;
        """

query2 = sql.read_sql(query, con=db_connection)
query2

          country  Number of Furniture
0          France                  299
1         Germany                  264
2  United Kingdom                  180
3           Italy                  136
4           Spain                  123
5     Netherlands                   76
6         Austria                   40
7          Sweden                   36
8         Belgium                   20
9         Finland                   16

#### 9.B Select Number of 'Furniture' Orders For The Country Denmark

In [144]:
# Select Number of 'Furniture' Orders For The Country Denmark

query = """
        SELECT o.country, COUNT(b.category) AS "Number of Furniture"
        FROM orders AS o
        LEFT JOIN orders_break_down AS b 
        ON o.order_id = b.order_id
        WHERE b.category = 'Furniture'
        AND o.country = 'Denmark'
        GROUP BY o.country
        ORDER BY "Number of Furniture" DESC
        LIMIT 10;
        """

query3 = sql.read_sql(query, con=db_connection)
query3

   country  Number of Furniture
0  Denmark                    9

#### 10. Select Total Sales With Discount and Without Discount for Each Country

In [146]:
# Select Total Sales With Discount and Without Discount for Each Country

query = """
        SELECT o.country, (b.sales*b.quantity) AS "Total Sales", (b.sales*b.quantity - b.discount) "Total Sales With Discount"
        FROM orders AS o
        LEFT JOIN orders_break_down AS b 
        ON o.order_id = b.order_id
        GROUP BY o.country
        ORDER BY "Total Sales" DESC
        LIMIT 10;
        """
query4 = sql.read_sql(query, con=db_connection)
query4

          country  Total Sales  Total Sales With Discount
0  United Kingdom       5978.0                     5978.0
1        Portugal       1710.0                     1709.5
2         Finland        780.0                      780.0
3         Ireland        555.0                      554.5
4          France        420.0                      420.0
5           Spain        200.0                      200.0
6          Sweden        135.0                      134.5
7           Italy         66.0                       66.0
8         Austria         55.0                       55.0
9         Denmark         51.0                       50.5

#### 11.A Select Total Quantity, Total Sales for Each Country

In [147]:
# Select Total Quantity, Total Sales for Each Country

query = """
        SELECT o.country, b.quantity, (b.sales*b.quantity) AS "Total Sales", (b.sales*b.quantity - b.discount) "Total Sales With Discount"
        FROM orders AS o
        LEFT JOIN orders_break_down AS b 
        ON o.order_id = b.order_id
        GROUP BY o.country
        ORDER BY "Total Sales" DESC
        LIMIT 10;
        """
query4 = sql.read_sql(query, con=db_connection)
query4

          country  quantity  Total Sales  Total Sales With Discount
0  United Kingdom         7       5978.0                     5978.0
1        Portugal         3       1710.0                     1709.5
2         Finland         4        780.0                      780.0
3         Ireland         3        555.0                      554.5
4          France         3        420.0                      420.0
5           Spain         5        200.0                      200.0
6          Sweden         3        135.0                      134.5
7           Italy         3         66.0                       66.0
8         Austria         1         55.0                       55.0
9         Denmark         3         51.0                       50.5

#### 11.B Select Top 3 Country Based on Sales

In [154]:
# Select Top 3 Country Based on Sales

query = """
        SELECT o.country, b.quantity, (b.sales*b.quantity) AS "Total Sales", (b.sales*b.quantity - b.discount) "Total Sales With Discount"
        FROM orders AS o
        LEFT JOIN orders_break_down AS b 
        ON o.order_id = b.order_id
        GROUP BY o.country
        ORDER BY "Total Sales With Discount" DESC
        LIMIT 3;
        """
query4 = sql.read_sql(query, con=db_connection)
query4

          country  quantity  Total Sales  Total Sales With Discount
0  United Kingdom         7       5978.0                     5978.0
1        Portugal         3       1710.0                     1709.5
2         Finland         4        780.0                      780.0

#### 11.C Select Bottom 3 Country Based On Quantities

In [28]:
# Select Bottom 3 Country Based On Quantities

query = """
        SELECT o.country, b.quantity, (b.sales*b.quantity) AS "Total Sales", (b.sales*b.quantity - b.discount) "Total Sales With Discount"
        FROM orders AS o
        LEFT JOIN orders_break_down AS b 
        ON o.order_id = b.order_id
        GROUP BY o.country
        ORDER BY b.quantity
        LIMIT 3;
        """
query4 = sql.read_sql(query, con=db_connection)
query4

       country  quantity  Total Sales  Total Sales With Discount
0      Austria         1         55.0                       55.0
1       Norway         1         13.0                       13.0
2  Switzerland         1         19.0                       19.0

#### 12. Select Average Sales By Categroy For The Country 'France'

In [29]:
# Select Average Sales By Categroy For The Country 'France'

query = """
        SELECT o.country, b.category, AVG(b.sales*b.quantity - b.discount) "Average Total Sales With Discount"
        FROM orders AS o
        LEFT JOIN orders_break_down AS b 
        ON o.order_id = b.order_id
        WHERE o.country = 'France'
        GROUP BY o.country, b.category
        ORDER BY "Average Total Sales With Discount";
        """
query4 = sql.read_sql(query, con=db_connection)
query4

  country         category  Average Total Sales With Discount
0  France  Office Supplies                         847.168400
1  France       Technology                        2956.403756
2  France        Furniture                        3091.668395

#### 13. Select Country, Category and Total Sales Where Average Total Sales is The Highest

In [30]:
# Select Country, Category and Total Sales Where Average Total Sales is The Highest

query = """
        SELECT o.country, b.category, (b.sales*b.quantity - b.discount) "Total Sales", AVG(b.sales*b.quantity - b.discount) "Average Total Sales"
        FROM orders AS o
        LEFT JOIN orders_break_down AS b 
        ON o.order_id = b.order_id
        GROUP BY o.country, b.category
        ORDER BY "Average Total Sales" DESC;
        """
query4 = sql.read_sql(query, con=db_connection)
query4

           country         category  Total Sales  Average Total Sales
0      Switzerland       Technology        612.0          6487.846154
1          Belgium       Technology       1050.0          5000.526316
2           Norway        Furniture        396.0          4894.500000
3   United Kingdom       Technology        323.9          3798.169835
4            Spain       Technology        586.9          3676.299259
5          Germany       Technology       1044.0          3198.119936
6           France        Furniture        154.9          3091.668395
7           France       Technology         87.5          2956.403756
8   United Kingdom        Furniture       5978.0          2772.481111
9          Austria       Technology       2640.0          2675.170213
10         Austria        Furniture        174.0          2629.400000
11         Finland        Furniture        534.0          2528.750000
12          Norway       Technology        264.0          2457.777778
13           Spain        Furniture        535.4          2365.364228
14         Germany        Furniture       2759.9          2309.768750
15           Italy       Technology         29.6          2255.883422
16     Netherlands        Furniture        800.8          2209.955263
17           Italy        Furniture       1650.0          2153.633824
18          Sweden        Furniture         79.4          2146.455556
19     Switzerland        Furniture       1560.0          2054.545455
20        Portugal       Technology       1709.5          1798.884615
21         Belgium        Furniture      10380.0          1757.650000
22         Finland       Technology        636.0          1732.200000
23         Ireland       Technology        554.5          1605.738095
24     Netherlands       Technology        359.5          1536.406667
25        Portugal        Furniture        509.5          1520.300000
26         Ireland        Furniture       5144.5          1198.225000
27        Portugal  Office Supplies         33.5          1191.606383
28         Denmark       Technology        623.5          1160.166667
29           Spain  Office Supplies        200.0          1100.528231
30         Belgium  Office Supplies         24.0          1038.187500
31         Austria  Office Supplies         55.0           908.389831
32          Sweden       Technology        145.5           897.705882
33          France  Office Supplies        420.0           847.168400
34  United Kingdom  Office Supplies         33.5           833.689574
35         Germany  Office Supplies         34.0           757.745446
36           Italy  Office Supplies         66.0           705.875000
37         Denmark        Furniture        260.5           674.555556
38     Switzerland  Office Supplies         19.0           642.944444
39         Finland  Office Supplies        780.0           637.342105
40          Norway  Office Supplies         13.0           571.108696
41          Sweden  Office Supplies        134.5           455.364662
42         Ireland  Office Supplies        344.5           411.559701
43     Netherlands  Office Supplies         26.5           398.090909
44         Denmark  Office Supplies         50.5           374.192308

### JOINS

Below is a link to a handy reference for SQL joins. In this chart joins are represented in terms of sets and venn diagrams. 
https://www.codeproject.com/Articles/33052/Visual-Representation-of-SQL-Joins

Alternatively, remember the merge functionality of pandas.
https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf

### ADDITIONAL RESOURCES

- [sqlite3 home](http://www.sqlite.org)  
- [sqlite3 Python documentation](https://docs.python.org/3/library/sqlite3.html)
- [SQLite Python tutorial](http://sebastianraschka.com/Articles/2014_sqlite_in_python_tutorial.html)  
- [SQL zoo](http://www.sqlzoo.net)  Great for learning syntax



---



---



> > > > > > > > >  2021 Institute of Data


---



---